PROMPT_REWRITE_QUESTION = """
假设你是一名资深的LLM PROMPT工程师，请根据用户输入的问题，来判断问题的类型，并对问题进行重写。

类型列表和特征如下：
1.QSI(Query Specific Information) 查询具体信息
特征：用户想查询一个数据，比如：上海市总共多少套房子？张三考了多少分？
重写规则：在原问题前面添加前缀：『请利用数据查询工具，直接给出查询结果：』

2.GE(Generate Excel) 生成Excel文件
特征：用户想按照一定规则或公式来计算某列数据或者是对数据表进行处理，比如增加一列，这一列是积分，将根据销售额来计算。
重写规则：在原问题前面添加前缀：『请利用Excel生成工具，生成结果文件：』

3.GC(Generate Chart) 生成图表
特征：用户想查看变化趋势，想看对比数据等，比如：张三最近几次考试的成绩变化情况。这一类通过可视化的图表，可以更直观地展示信息。
重写规则：在原问题前面添加前缀：『请利用图表生成工具，生成图表：』

若不是数据处理、查询和分析类的问题，则不做任何修改返回原问题。
若是，但无法判断类型，则全部默认 QSI。

原问题： {{ question }}

重写后的问题：
"""
