Repository: pypi-data/pypi-mirror-250
Catalog: packages/stela-control-publishing/stela_control_publishing-0.1.46.tar.gz/stela_control_publishing-0.1.46/stela_control/locale/*/LC_MESSAGES/django.po
Languages: es

source: Full Name
es: Nombre

source: about
es: acerca

source: Country
es: Pais

source: Address
es: Dirección

source: City
es: Cuidad

source: Activation
es: Activacion

source: Control of user status
es: Control del estado del usuario

source: If you accept, we will keep you informed of all our promotions and offers.
es: Si acepta, le mantendremos informado de todas nuestras promociones y ofertas.

source: Activate your account
es: Activa tu cuenta.

source: email not available
es: ¡Correo no disponible!

source: email available
es: Correo disponible

source: username not available
es: ¡Usuario no disponible!

source: invalid username only lower case, numbers and (_) accepted
es: Nombre de usuario inválido, solo se aceptan letras minúsculas, números y (_)

source: username available
es: Usuario disponible

source: Password must be at least 8 characters long
es: La contraseña debe tener al menos 8 caracteres de longitud.

source: Password must contain only alphanumeric and special characters (a-zA-Z0-9*$_.)
es: La contraseña debe contener solo caracteres alfanuméricos y especiales (a-zA-Z0-9*$_.)

source: Password must contain at least one number
es: La contraseña debe contener al menos un número.

source: Password Reset
es: Recuperacion de Contraseña

source: We have sent recovery link.
es: Hemos enviado un enlace de recuperación.

source: Your new password has been set.
es: Su nueva contraseña ha sido establecida.

source: Link is expired
es: El enlace ha caducado

source: Something went wrong, redirecting back to account login
es: Algo salió mal, redireccionando al inicio

source: Price USD
es: Precio USD

source: The price must be between 0 and 9999.99
es: El precio debe oscilar entre 0 y 9999.99

source: Created
es: Creado

source: English
es: Inglés

source: Your Name is?
es: ¿Tu nombre es?

source: Subject
es: Asunto

source: Place Email
es: Coloca Email

source: Your Message
es: Tu Mensaje

source: Your message has been sent
es: Tu mensaje ha sido enviado

source: This email is already registered
es: No hay correos

source: Now you are subscribed
es: Ahora estas suscrito

source: Payment Complete Successfully
es: Pago efectuado exitosamente

source: Thanks for your purchase
es: Gracias por su compra

source: Amount Verification Failed
es: La verificación del monto ha fallado.

source: Stela Business App
es: Aplicación de negocios Stela

source: Billing Notification
es: Notificación de cobro

source: User has answered his case
es: El usuario ha respondido su caso.

source: Changes made successfully
es: Cambios realizados con éxito

source: Data email with this Email already exists.
es: El correo electrónico de datos con este correo electrónico ya existe.

source: Enter a valid email address.
es: Introduzca una dirección de correo electrónico válida.

source: You Have a New Project
es: Tienes un nuevo proyecto

source: We start jobs for
es: Comenzamos trabajos para

source: You Have a Sale
es: Tienes una venta

source: Next
es: Siguiente

source: Previous
es: Antes

source: Please correct the errors
es: Por favor corrija los errores

source: At least 8 alphanumeric characters and one special
es: Al menos 8 caracteres alfanuméricos y uno especial

source: Submit
es: Envíar

source: Complete Info
es: Completar Info

source: Congratulations you are about to complete the purchase.
es: Enhorabuena, estás a punto de completar la compra.

source: There are only a few steps left to finish please complete your profile to be able to make payments.
es: Solo quedan unos pocos pasos para terminar, por favor complete su perfil para sercapaz de hacer pagos.

source: Save
es: Guardar

source: You need to be logged in Emmerut Linkzone to be able to use Stela's products.
es: Debe iniciar sesión en Emmerut Linkzone para poder utilizar los productos de Stela.

source: All Stela Control Dynamic services and products belong
es: Todos los servicios y productos Stela Control Dynamic pertenecen

source: to Emmerut Group and are in charge of managing all operations.
es: al Grupo Emmerut y están a cargo de administrar todas las operaciones.

source: Error: You are not authorized to login.
es: Error: No está autorizado para iniciar sesión

source: Password
es: Contraseña

source: Reset Password
es: Restablecer la contraseña

source: Log In
es: Ingresar

source: You don't have an account yet?
es: ¿Aun no tienes cuenta?

source: Sign up.
es: Registrate

source: Sign In
es: Iniciar Sesion

source: Log in
es: Ingresar

source: Sign Up
es: Registrate

source: New password request
es: Nueva solicitud de contraseña

source: Your password cannot be allusive to personal information
es: Su contraseña no puede ser alusiva a información personal

source: It cannot be the same as the previous ones
es: No puede ser lo mismo que los anteriores.

source: Login
es: Iniciar sesion

source: Enter your email to recover the password.
es: Introduce tu email para recuperar la contraseña.

source: Send
es: Envíar

source: No comments so far
es: No hay comentarios hasta ahora

source: Leave a reply
es: Deja una respuesta

source: Newsletter
es: Boletín

source: Please go to the following page and choose a new password:
es: Vaya a la siguiente página y elija una nueva contraseña:

source: Thanks for using our site!
es: Gracias por usar nuestro sitio

source: The %(site_name)s team
es: El %(site_name)s equipo

source: GO LINKZONE
es: IR A LINKZONE

source: Your Cloud Services
es: Tus Servicios Cloud

source: Secure storage and access from anywhere.
es: Almacenamiento seguro y acceso desde cualquier lugar.

source: Projects Active
es: Proyectos Activos

source: Status
es: Estado

source: Zone
es: Zona

source: System
es: Sistema

source: No Account Started
es: No tienes cuenta

source: Active
es: Activo

source: Inactive
es: Inactivo

source: Control Usage
es: Control de uso

source: Virtual Cloud Usage (Hours)
es: Uso del servidor de nube virtual (horas)

source: Quick access
es: Acceso rápido

source: EC2 System
es: Sistema EC2

source: Orbit DNS
es: Órbita DNS

source: Storage Buckets
es: Buckets de almacenamiento

source: Cloud Billing Information
es: Información de cobranza de la nube

source: Billing ID
es: ID de cobranza

source: Amount
es: Monto

source: Date
es: Fecha

source: View
es: Vista

source: Payeed
es: Pagado

source: Pending
es: Pendiente

source: You do not have cloud infrastructure activated
es: No tienes la infraestructura en la nube activada.

source: Loading
es: Cargando

source: Processing
es: Procesando

source: Billing Recipt Details
es: Detalles del recibo de facturación

source: Get Invoice
es: Obtener Factura

source: Client
es: Cliente

source: Cost items
es: Elementos de costo

source: units
es: unidades

source: per 20000 units
es: por 20000 unidades

source: Discounts
es: Descuentos

source: Subtotal
es: Base imponible

source: Tax
es: Impuestos

source: Total Amount
es: Monto

source: Service Report
es: Reporte de servicio

source: payment in process
es: Pago en proceso

source: Stela Payments
es: Stela Transacciones

source: do not interrupt this process
es: no interrumpa este proceso

source: safe redirect
es: redirección segura

source: Successful Payment!.
es: ¡Pago Exitoso!

source: Continue
es: Continuar

source: Payment Failed!.
es: Pago fallido

source: Warning, we have detected suspicious activity
es: Advertencia, hemos detectado actividad sospechosa.

source: About Us
es: Sobre Nosotros

source: Title
es: Titulo

source: Content
es: Contenido

source: Subtitle
es: Subtitulo

source: Our Business Solutions
es: Nuestras Soluciones Comercles

source: Load Legal
es: Cargar Documento Legal

source: Vision
es: Visión

source: Mission
es: Misión

source: Values
es: Valores

source: Questions
es: Pregunta

source: Proccess data, please wait
es: Procesando, por favor espere

source: Confirm?
es: ¿Confirmas?

source: Make Payment
es: Hacer el pago

source: New Case
es: Nuevo caso

source: Tell us your case we are here to help you.
es: Cuéntanos tu caso estamos para ayudarte.

source: Send Case
es: Envía el caso

source: Support Control Center
es: Centro de control de soporte

source: Here you will track all cases.
es: Aquí harás un seguimiento de todos los casos.

source: Filter List
es: Filtro

source: Select an option
es: Selecciona una opción

source: Now
es: Ahora

source: Older
es: Más antiguo

source: Week Ago
es: Hace una semana

source: Month Ago
es: Hace un mes

source: Search Case
es: Buscar caso

source: ID Case
es: ID Caso

source: Create
es: Crear

source: User
es: Usuario

source: Open
es: Abierto

source: Close
es: Cerrado

source: (current)
es: Actual

source: Case
es: Caso

source: Here you can evaluate the detail of your requirement
es: Aquí puede evaluar el detalle de su requerimiento

source: Thanks!
es: ¡Gracias!

source: We have also sent a copy of this link to your email.
es: También hemos enviado una copia de este enlace a su correo electrónico.

source: For more information regarding various situations, we invite you to review
es: Para obtener más información sobre diversas situaciones, lo invitamos a revisar

source: our sections
es: Nuestras secciones

source: You are welcome to contact us for any
es: Le invitamos a ponerse en contacto con nosotros para cualquier

source: of the means of communication available, the objective is the
es: de los medios de comunicación disponibles, el objetivo es la

source: satisfaction and enjoyment of the products and services of this site.
es: satisfacción y disfrute de los productos y servicios de este sitio.

source: Support Team
es: Equipo de soporte

source: Respond
es: Responder

source: We are currently evaluating your request.
es: Actualmente estamos evaluando su solicitud.

source: In the next few hours we will be giving you an answer
es: En las próximas horas les estaremos dando respuesta

source: we appreciate all your patience and trust.
es: agradecemos toda su paciencia y confianza.

source: case close
es: Caso cerrado

source: Checkout
es: Pasarela de pago

source: Owner
es: Propietario

source: Integration
es: Integración

source: Billing
es: Cobro

source: Modules
es: Modulos

source: Template
es: Plantillas

source: Cost
es: Costo

source: Secure Payments
es: Pago seguro

source: Purchase amount
es: Monto del pago

source: Pay now
es: Pagar

source: Payment Fee
es: Comision TDD

source: Payment Method
es: Metodo de pago

source: Billing Recipt
es: Recibo de cobro

source: Failed Payment!.
es: ¡Pago fallido!.

source: Linkzone Purchases
es: Compras Linkzone

source: Hours
es: Horas

source: GB Data
es: Datos en GB

source: DNS Usage
es: Uso DNS

source: Confirm selection to purchase
es: Confirmar selección para comprar

source: Resources
es: Recursos

source: Domain
es: Dominio

source: Check
es: Chequear

source: Check your selection
es: Revisa tu selección

source: Included
es: Incluido

source: Free Registration
es: Registro Gratis

source: Initial Payment
es: Pago Inicial

source: Restart
es: Reiniciar

source: congratulations you have managed to customize your site
es: Felicidades has logrado personalizar tu sitio.

source: Website Added.
es: Servicio añadido

source: Go Checkout
es: Ir al Checkout

source: Order Another
es: Pide otro

source: Domain Name
es: Nombre Dominio

source: Remove
es: Eliminar

source: Remove selection
es: Elimina tu selección

source: This option cannot be reversed!
es: ¡Esta opción no se puede revertir!

source: Yes, remove!
es: Si, Eliminalo

source: Cancel
es: Cancelar

source: were successfully removed.
es: fueron eliminados con éxito.

source: no items in checkout
es: No hay artículos

source: List of Products
es: Lista de productos

source: Please enter
es: Por favor ingrese

source: to continue.
es: para continuar

source: Linkzone Websites
es: Sitios Web Linkzone

source: Profile Center
es: Centro de perfiles

source: Complete Profile
es: Completar Perfíl

source: Create New Address
es: Crear nueva dirección

source: Payments Preference
es: Referencias de pago

source: Close Account
es: Cerrar cuenta

source: Main Address
es: Dirección Principal

source: Address Line
es: Dirección

source: Phone
es: Teléfono

source: Default
es: establecer predeterminado

source: No address registered
es: No hay direcciones registradas

source: Wish List
es: Ver lista

source: No products registered
es: No hay productos registrados

source: Set Default
es: establecer predeterminado

source: Delete Address
es: Borrar Dirección

source: Edit
es: Editar máscota

source: Select Default
es: establecer predeterminado

source: Back
es: Atrás

source: Language
es: Idioma

source: Notifications
es: Notificaciones

source: clean
es: limpiar

source: You have no notifications
es: No tienes notificaciones

source: Settings
es: Opciones

source: Logout
es: Salir

source: SIDEBAR SKINS
es: TEMAS DE SIDEBAR

source: HEADER SKINS
es: TEMAS DE HEADER

source: Purchases
es: Compras

source: Cloud Services
es: Servicios Cloud

source: Support
es: Soporte

source: Hello
es: Hola

source: This is your center panel
es: Este es tu panel central

source: Purchase Pending
es: Compra pendiente

source: Pay
es: Pagos

source: There is no pending purchase
es: No hay ninguna compra pendiente

source: Billings
es: Cobros

source: You can see all the information and progress of each of your projects.
es: Podrás ver toda la información y avances de cada uno de tus proyectos.

source: Price
es: Precio

source: High Price
es: Mayor precio

source: Low Price
es: Menor precio

source: New
es: Nuevo

source: Latest
es: Último

source: Success
es: Exitoso

source: Order ID
es: ID Pedido

source: Superuser
es: Superusuario

source: Access
es: Acceso

source: Project Progress
es: Progreso del proyecto

source: Credentials
es: Credenciales

source: Deploy
es: Despliege

source: Add
es: Agregar

source: Recipt
es: Recibo

source: Reviews.
es: Reseñas

source: Service
es: Servicio

source: Description
es: Descripción

source: Name
es: Nombre

source: Update Catalog Form
es: Actualizar formulario de catálogo

source: Are you sure?
es: ¿Estas seguro?

source: Home
es: Inicio

source: About
es: Nosotros

source: Services
es: Servicios

source: Projects
es: Proyectos

source: Our Portofolio
es: Nuestro portafolio

source: See Our Recent
es: Vea nuestro reciente

source: Website
es: Sitio web

source: Content Tag
es: Contenido

source: Recent News
es: Noticias del sitio

source: Check Our
es: Revisa nuestras

source: Posts
es: Publicaciones

source: By
es: Por

source: Discover More
es: Descubrir más

source: New Post Created
es: Nueva publicación

source: By: Andrea Mentuzi
es: Por: Andrea Mentuzi

source: Main Post
es: Titular de la publicación

source: a ten minutes ago
es: hace diez minutos

source: Discover more
es: Descubrir más

source: A division of
es: Una división de

source: we invite you to discover more
es: te invitamos a descubrir más

source: Site Sections
es: Secciones del sitio

source: Our Services
es: Nuestros Servicios

source: Projects portfolio
es: Portafolio de proyectos

source: Terms & Conditions
es: Términos

source: Privacy Policies
es: Políticas de Privacidad

source: Last Blogs
es: Últimos Post

source: Emmerut F.A.Q.
es: Emmerut P.F.C

source: Locations
es: Ubicaciones

source: All Rights Reserved
es: Todos los derechos reservados

source: Sending...
es: Envíando...

source: All Rights Reserved.
es: Todos los derechos reservados
